rahul/homework3_movie_app/movie_app/app/controllers/movies_controller.rb

  def create
      @movie = Movie.new(white_listed_parameters)
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "year_released", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    get_movie
    if @movie.update_attributes(white_listed_parameters)
---
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "Yet another dinosaur movie for the modern ages..."], ["updated_at", "2015-07-05 01:29:20.960053"], ["id", 22]]