rahul/homework3_movie_app/movie_app/app/controllers/search_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%the%')  ORDER BY created_at DESC
---
  def index
    if params[:search]
      @movies = Movie.search(params[:search])